Autodesk.Revit.DB.Geolocation.BasicGeolocation.AddGeographicReferencePointCRS(Autodesk.Revit.DB.Geolocation.CrsEncodingType,System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Geolocation.BasicGeolocation.SetGeographicReferencePoint(Autodesk.Revit.DB.Geolocation.GeographicalCoordinate)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null